src/main/resources/samples/queryAddress/bank-request1.xml

<?xml version="1.0" encoding="UTF-8" standalone="no" ?>
<soap:Envelope    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
                  xmlns:blz="http://thomas-bayer.com/blz">
    <soap:Header/>
    <soap:Body>
        <blz:getBank>
            <blz:blz>35070030 ${database}</blz:blz>
        </blz:getBank>
    </soap:Body>
</soap:Envelope>